In [78]:
import pandas as pd
import numpy as np

In [79]:
pd.set_option('display.max_rows', 100)

In [80]:
print(open('data/attacks.csv')) #specify encoding in read_csv method

<_io.TextIOWrapper name='data/attacks.csv' mode='r' encoding='cp1252'>

In [81]:
df = pd.read_csv('data/attacks.csv' , encoding = 'cp1252')

In [82]:
df.head()

,Case Number,Date,Year,Type,Country,Area,Location,Activity,Name,Sex,...,Species,Investigator or Source,pdf,href formula,href,Case Number.1,Case Number.2,original order,Unnamed: 22,Unnamed: 23
0,2018.06.25,25-Jun-2018,2018.0,Boating,USA,California,"Oceanside, San Diego County",Paddling,Julie Wolfe,F,...,White shark,"R. Collier, GSAF",2018.06.25-Wolfe.pdf,http://sharkattackfile.net/spreadsheets/pdf_di...,http://sharkattackfile.net/spreadsheets/pdf_di...,2018.06.25,2018.06.25,6303.0,NaN,NaN
1,2018.06.18,18-Jun-2018,2018.0,Unprovoked,USA,Georgia,"St. Simon Island, Glynn County",Standing,Adyson McNeely,F,...,NaN,"K.McMurray, TrackingSharks.com",2018.06.18-McNeely.pdf,http://sharkattackfile.net/spreadsheets/pdf_di...,http://sharkattackfile.net/spreadsheets/pdf_di...,2018.06.18,2018.06.18,6302.0,NaN,NaN
2,2018.06.09,09-Jun-2018,2018.0,Invalid,USA,Hawaii,"Habush, Oahu",Surfing,John Denges,M,...,NaN,"K.McMurray, TrackingSharks.com",2018.06.09-Denges.pdf,http://sharkattackfile.net/spreadsheets/pdf_di...,http://sharkattackfile.net/spreadsheets/pdf_di...,2018.06.09,2018.06.09,6301.0,NaN,NaN
3,2018.06.08,08-Jun-2018,2018.0,Unprovoked,AUSTRALIA,New South Wales,Arrawarra Headland,Surfing,male,M,...,2 m shark,"B. Myatt, GSAF",2018.06.08-Arrawarra.pdf,http://sharkattackfile.net/spreadsheets/pdf_di...,http://sharkattackfile.net/spreadsheets/pdf_di...,2018.06.08,2018.06.08,6300.0,NaN,NaN
4,2018.06.04,04-Jun-2018,2018.0,Provoked,MEXICO,Colima,La Ticla,Free diving,Gustavo Ramos,M,...,"Tiger shark, 3m",A .Kipper,2018.06.04-Ramos.pdf,http://sharkattackfile.net/spreadsheets/pdf_di...,http://sharkattackfile.net/spreadsheets/pdf_di...,2018.06.04,2018.06.04,6299.0,NaN,NaN

In [83]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 25723 entries, 0 to 25722
Data columns (total 24 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   Case Number             8702 non-null   object
 1   Date                    6302 non-null   object
 2   Year                    6300 non-null   float64
 3   Type                    6298 non-null   object
 4   Country                 6252 non-null   object
 5   Area                    5847 non-null   object
 6   Location                5762 non-null   object
 7   Activity                5758 non-null   object
 8   Name                    6092 non-null   object
 9   Sex                     5737 non-null   object
 10  Age                     3471 non-null   object
 11  Injury                  6274 non-null   object
 12  Fatal (Y/N)             5763 non-null   object
 13  Time                    2948 non-null   object
 14  Species                 3464 non-null   object
 15  Investigator or Source  6285 non-null   object
 16  pdf                     6302 non-null   object
 17  href formula            6301 non-null   object
 18  href                    6302 non-null   object
 19  Case Number.1           6302 non-null   object
 20  Case Number.2           6302 non-null   object
 21  original order          6309 non-null   float64
 22  Unnamed: 22             1 non-null      object
 23  Unnamed: 23             2 non-null      object
dtypes: float64(2), object(22)
memory usage: 4.7+ MB

## DataSet Cleaning

### Unnamed columns

In [84]:
df[df["Unnamed: 22"].notnull()]

,Case Number,Date,Year,Type,Country,Area,Location,Activity,Name,Sex,...,Species,Investigator or Source,pdf,href formula,href,Case Number.1,Case Number.2,original order,Unnamed: 22,Unnamed: 23
1478,2006.05.27,27-May-2006,2006.0,Unprovoked,USA,Hawaii,"North Shore, O'ahu",Surfing,Bret Desmond,M,...,NaN,R. Collier,2006.05.27-Desmond.pdf,http://sharkattackfile.net/spreadsheets/pdf_di...,http://sharkattackfile.net/spreadsheets/pdf_di...,2006.05.27,2006.05.27,4825.0,stopped here,NaN

In [85]:
df[df["Unnamed: 23"].notnull()]

,Case Number,Date,Year,Type,Country,Area,Location,Activity,Name,Sex,...,Species,Investigator or Source,pdf,href formula,href,Case Number.1,Case Number.2,original order,Unnamed: 22,Unnamed: 23
4415,1952.03.30,30-Mar-1952,1952.0,Unprovoked,NETHERLANDS ANTILLES,Curacao,NaN,Went to aid of child being menaced by the shark,A.J. Eggink,M,...,"Bull shark, 2.7 m [9'] was captured & dragged ...","J. Randall, p.352 in Sharks & Survival; H.D. B...",1952.03.30-Eggink.pdf,http://sharkattackfile.net/spreadsheets/pdf_di...,http://sharkattackfile.net/spreadsheets/pdf_di...,1952.03.30,1952.03.30,1888.0,NaN,Teramo
5840,1878.09.14.R,Reported 14-Sep-1878,1878.0,Provoked,USA,Connecticut,"Branford, New Haven County",Fishing,Captain Pattison,M,...,NaN,"St. Joseph Herald, 9/14/1878",1878.09.14.R-Pattison.pdf,http://sharkattackfile.net/spreadsheets/pdf_di...,http://sharkattackfile.net/spreadsheets/pdf_di...,1878.09.14.R,1878.09.14.R,463.0,NaN,change filename

In [86]:
# unnamed columns don't add any value to the analysis, dropped.
df.drop(labels=["Unnamed: 23","Unnamed: 22"], axis=1,inplace=True)

### Case Number

#### not dopping case number yet, might be useful to extract dates

In [106]:
#df[["Case Number","Case Number.1","Case Number.2"]]

df["Case Number"].replace(["0",0,"xx"],np.nan,inplace=True)


df.drop("original order", axis = 1, inplace=True) # original order doesn't add value
df.dropna(axis = 0, how= "all", inplace=True)
#df.drop(["original order","Case Number.1","Case Number.2"]) # original order not useful

In [115]:




df[["Case Number","Case Number.1"]][df["Case Number"] != df["Case Number.1"]]

       Case Number Case Number.1
34      2018.04.03    2018.04.02
117   2017.07.20.a  2017/07.20.a
144     2017.05.06    2017.06.06
217     2016.09.15    2016.09.16
314   2016.01.24.b  2015.01.24.b
334     2015.12.23    2015.11.07
339   2015.10.28.a    2015.10.28
390     2015.07-10    2015.07.10
560     2014.05.04    2013.05.04
3522    1967.07.05    1967/07.05
3795  1962,08.30.b  1962.08.30.b
3880  1961.09.02.R  1961.09,06.R
4403    1952.08.05    1952.08.04
4425  1851.12.15.R  1951.12.15.R
4949  1934.01.08.R  1934.02.08.R
5275  1900.00.00.R  1919.00.00.R
5358  1913.07.10.R  1913.17.10.R
5386  1911.07.31.R  1911.07.31.T
5488           NaN  1905.09.06.R
5777  1884.04.38.R  1884.04.28.R
5883  1876.06.18.R  1874.06.18.R
5944       1864.05    1864.05.00
6009    1853,94.29    1853.04.29
6122  1808.06.01.R  1808.05.01.R

In [116]:
df[["Case Number","Case Number.2"]][df["Case Number"] != df["Case Number.2"]]

       Case Number Case Number.2
390     2015.07-10    2015.07.10
4949  1934.01.08.R  1934.02.08.R
5488           NaN  1905.09.06.R
5944       1864.05    1864.05.00

## next

In [136]:
pd.set_option('display.max_rows', 100)
#df["date_fix"] = df["Date"].str.extract(r"(\w{3}-\d{4})")

df[["date_fix","Date"]]

      date_fix         Date
0     Jun-2018  25-Jun-2018
1     Jun-2018  18-Jun-2018
2     Jun-2018  09-Jun-2018
3     Jun-2018  08-Jun-2018
4     Jun-2018  04-Jun-2018
...        ...          ...
6297       NaN  Before 1903
6298       NaN  Before 1903
6299  900-1905    1900-1905
6300  883-1889    1883-1889
6301  845-1853    1845-1853

[6302 rows x 2 columns]

In [137]:
pd.set_option('display.max_rows', 100)
df[["Date","Case Number","Case Number.1","Case Number.2"]]

             Date Case Number Case Number.1 Case Number.2
0     25-Jun-2018  2018.06.25    2018.06.25    2018.06.25
1     18-Jun-2018  2018.06.18    2018.06.18    2018.06.18
2     09-Jun-2018  2018.06.09    2018.06.09    2018.06.09
3     08-Jun-2018  2018.06.08    2018.06.08    2018.06.08
4     04-Jun-2018  2018.06.04    2018.06.04    2018.06.04
...           ...         ...           ...           ...
6297  Before 1903     ND.0005       ND.0005       ND.0005
6298  Before 1903     ND.0004       ND.0004       ND.0004
6299    1900-1905     ND.0003       ND.0003       ND.0003
6300    1883-1889     ND.0002       ND.0002       ND.0002
6301    1845-1853     ND.0001       ND.0001       ND.0001

[6302 rows x 4 columns]